In [4]:
import pandas as pd

In [7]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df_student = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df_student

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

# Group By
>**df.groupby(column명)** : column으로 group by

In [14]:
groupby_major = df_student.groupby('major')

#groupby_major.groups

for name, group in groupby_major :
    print(name + " : " + str(len(group)) )
    print(group)
    print('\n')

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male


Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female


Physics : 1
      name    major   sex
2  Abraham  Physics  male


Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

- **reset_index()** : index를 column으로 변경

In [19]:
major_student_cnt = pd.DataFrame({'cnt' : groupby_major.size()}).reset_index()
major_student_cnt

              major  cnt
0  Computer Science    4
1         Economics    3
2           Physics    1
3        Psychology    3

# 중복 제거
>**df.duplicated()** : 중복 여부 확인  
**df.duplicated([column명])** : 특정 컬럼들의 내용이 중복된 경우 확인  
**df.drop_duplicates()** : 중복 제거  
**df.drop_duplicates([column명], keep=first/last)** : 특정 컬럼이 중복된 경우 제거 (keep옵션을 이용해 남겨둘 데이터 선택, 기본값은 first)

In [29]:
duplicate_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Janny', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
duplicate_df = pd.DataFrame(duplicate_list, columns = ['name', 'major', 'sex'])
duplicate_df

      name             major     sex
0     John  Computer Science    male
1    Janny  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Janny         Economics  female
5     John  Computer Science    male

In [30]:
duplicate_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [31]:
duplicate_df.drop_duplicates()

      name             major     sex
0     John  Computer Science    male
1    Janny  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Janny         Economics  female

In [32]:
duplicate_df.duplicated('name')

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [33]:
duplicate_df.drop_duplicates(['name'],keep='first')

      name             major   sex
0     John  Computer Science  male
1    Janny  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male

# Null(NaN, None) 처리
> **df.info()** : df의 정보 확인 (null값도 확인 가능!)  
**df.isna() ** , **df.isnull()** : null여부를 True, False로 확인  
**df[column명].fillna(value)** : column의 값이 null인 경우 value를 넣어준다.

In [5]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df_null = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df_null

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [9]:
df_null.info()
# df_null.isna()
# df_null.isnull()
df_null.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

name    0
job     0
age     2
dtype: int64

In [11]:
df_null['age'] = df_null['age'].fillna(0)

In [12]:
df_null

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [13]:
df_null = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [17]:
df_null["age"].fillna(df_null.groupby("job")["age"].transform("median"), inplace=True)
df_null

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

# Apply , Map
> **df.applymap(value)** : 모든 데이터를 바꾼다  
**df.map({obj})** : obj의 데이터를 바꾼다 (key값을 value값으로)

# Unique
> **df.column명.unique()** : unique한 값을 조회  
**df.column명.value_counts()** : column의 개수를 조회

In [19]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [22]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [23]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
basketball player    1
dentist              1
developer            1
Name: job, dtype: int64

# DF 합치기
> **pd.concat([dataFrame])** : DataFrame들을 합쳐준다.  
**df1.append(df2)** : df1에 d2 합치기

In [24]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [28]:
result = pd.concat([df1, df2], ignore_index = True)

In [29]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer